notes/d-deep-learning.org
#+TITLE: 1ヶ月で1から作るD言語のDeep Learningライブラリ
#+AUTHOR: Shigeki Karita
#+LANGUAGE: ja

#+OPTIONS: toc:t num:t H:4 ^:nil pri:t author:t creator:t timestamp:t email:nil
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/org.css"/>

#+BEGIN_abstract
いまD言語が熱い．D言語はC, C++やRustの代替となるべく，日々改良が重ねられテンプレートやモジュール，ガベージコレクション(GC)などのリッチな言語機能と，C/C++との互換性・同等の速さ・フットプリントの小ささを両立しています．最近ではCUDAライブラリのラッパーが充実し，LDCコンパイラではCUDA kernelが書けるようになりました．さらにnumpyのように多次元配列を自在に扱えるMirも登場しました．というわけでディープラーニング用のライブラリを書こうと思いました．
#+END_abstract

* 背景とD言語 (1日目, 5/7)

私は勤務先で日頃からC++でクローズドなDeep Learningライブラリを一人で作っていました．CPUホストコードではC++17をCUDAデバイスコードではC++14を使っていたので，型安全にジェネリックなコードを書き，shared_ptrを使って安全にコードを書いていましたが，ときどき循環参照を起こしてメモリリークを起こしてGCが欲しくなったり，SFINAEに頼ってジェネリックなコードを書くのに辛くなってきました．そんな中でGCがあり，SFINAEに頼らない簡単・自然なメタプログラミング機能を使えるD言語を使いたい気持ちは日に日に高まっていきました．

そんな中，10連休に及ぶGWは仕事のことは忘れて虚無に過ごしたのですが，最終日に突如として[[https://github.com/libmir/dcompute][dcompute]]というD言語でCUDAカーネルを書く謎の技術を思い出し，触ってみました．結果から言うとコンパイルすらできなかったのですが...．いろいろ調べるとデバイス側のポインタの扱いやカーネル生成など大部分はすでにLDC本家にマージされており，若干の便利機能が残った部分がdcomputeライブラリとして残っていました．少し古いですが以下のページ

- CUDA Driver APIのD言語ラッパー [[https://github.com/DerelictOrg/DerelictCUDA/blob/master/source/derelict/cuda/driverapi.d][DerelictCUDA]]
- [[https://github.com/ldc-developers/ldc/blob/085d9a69db42a608759aea638b388f2149dd629a/tests/codegen/dcompute_cu_addrspaces.d#L3][LDCのCUDAカーネルからのPTX生成のテストコード]]
- [[https://llvm.org/docs/NVPTXUsage.html#llvm-nvvm-ptr-to-gen-intrinsics][LLVMのPTXコード生成の仕組み]]
- [[https://llvm.org/docs/CompileCudaWithLLVM.html][ClangでCUDAバイナリをコンパイルする方法]]

を参考にしてMakefileからldc2コマンドを直に叩いてD言語からCUDAの中間コードであるPTXを生成し，dcomputeのexampleはよくわからないのでCUDA Driver APIで呼び出すことにしました．

#+begin_src makefile
kernel/%.ptx: kernel/%.d tool/compute_capability.out
    ldc2 $< --mdcompute-targets=cuda-$(CUDA_COMPUTE_CAPABILITY)0 -H -Hd kernel -mdcompute-file-prefix=$(shell basename -s .d $<)
    mv $(shell basename -s .d $<)_cuda$(CUDA_COMPUTE_CAPABILITY)0_$(CUDA_BIT).ptx $@
#+end_src

上記のコマンドでは，PTXファイル ~(モジュール名).ptx~ だけでなく，D言語のヘッダー定義 ~(モジュール名).di~ を生成して，PTXのJITコンパイル後の関数呼び出しにおける静的型検査に使おうと考えました(これは最後まで実装していないが，[[https://github.com/ShigekiKarita/d-nv/blob/master/source/dnv/typechecker.d][NVRTCラッパーを作ったときに同じことを]]以前やったので，そんなに難しくないと思います)．

この日はCUDA入門で最初にやるベクトル加算(axpy)の実装と実行まで動いています．困った点として，CUDA Driver APIにあるコンテキスト ~cuContext~ を破棄するタイミングが，GCより前に起こってしまい，いくつかのCUDA関係のオブジェクトのデストラクタがGCによってCUDA関係のDestroy/Free系関数を呼んでうまく開放できませんでした．簡単な解決策として， ~cuContext~ の破棄の前に明示的にGCを呼ぶことで回避しました．

#+begin_src d
module grain.cuda;

...

shared static ~this() {
    import core.memory : GC;
    GC.collect();
    checkCudaErrors(cuCtxDestroy(context));
}
#+end_src

3日目くらいで作業メモを残そうと思い，この文書を書き始めてタイトルには1週間と書いてみましたが，この期間は普通に働いているので一日2-5時間程度の作業時間でした．なおリポジトリは下記の通りで，git cloneしてmakeを叩けばテストまで走ります，動作していたDコンパイラは[[https://github.com/ldc-developers/ldc/releases/tag/v1.9.0][LDC1.9.0]](Linux X64)です．

- この日の最終 commit  https://github.com/ShigekiKarita/grain/tree/54c0c6b390c3258dcb80c5868cd3304387c6abdc

