notes/d-deep-learning.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2018-10-25 木 00:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>1ヶ月で1から作るD言語のDeep Learningライブラリ</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeki Karita" />
<link rel="stylesheet" type="text/css" href="css/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">1ヶ月で1から作るD言語のDeep Learningライブラリ</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb327a07">1. 背景とD言語 (1日目, 5/7)</a></li>
<li><a href="#org0839f4d">2. CPUホスト・CUDAデバイスそれぞれのメモリ管理 (2日目, 5/8)</a></li>
<li><a href="#org68f36f1">3. 虚無 (3日目, 5/9)</a></li>
<li><a href="#orgda63ca3">4. CPUホスト・CUDAデバイス両対応な関数オブジェクト (4日目, 5/10)</a>
<ul>
<li><a href="#org57fdeb7">4.1. Function 関数オブジェクト</a></li>
<li><a href="#org6a89c72">4.2. BLASライブラリの導入</a></li>
</ul>
</li>
<li><a href="#orge023f2f">5. シンプルな自動微分メカニズムと型消去 (5日目, 5/11)</a>
<ul>
<li><a href="#org240d69b">5.1. 自動微分の仕組み</a></li>
<li><a href="#orge7280af">5.2. 変数 Variable の仕組み</a></li>
</ul>
</li>
<li><a href="#org8ce5c2c">6. BackPropの実装とテスト (6日目, 5/12)</a>
<ul>
<li><a href="#org7934370">6.1. BackProp の実装</a></li>
</ul>
</li>
<li><a href="#org2c962e2">7. 手書き文字認識MNISTの実行 (7日目, 5/13)</a></li>
<li><a href="#orgbafb3f3">8. <span class="todo TODO">TODO</span> 残った課題</a></li>
</ul>
</div>
</div>
<div class="abstract">
<p>
いまD言語が熱い．D言語はC, C++やRustの代替となるべく，日々改良が重ねられテンプレートやモジュール，ガベージコレクション(GC)などのリッチな言語機能と，C/C++との互換性・同等の速さ・フットプリントの小ささを両立しています．最近ではCUDAライブラリのラッパーが充実し，LDCコンパイラではCUDA kernelが書けるようになりました．さらにnumpyのように多次元配列を自在に扱えるMirも登場しました．というわけでディープラーニング用のライブラリを書こうと思いました．
</p>

</div>

<div id="outline-container-orgb327a07" class="outline-2">
<h2 id="orgb327a07"><span class="section-number-2">1</span> 背景とD言語 (1日目, 5/7)</h2>
<div class="outline-text-2" id="text-1">
<p>
私は勤務先で日頃からC++でクローズドなDeep Learningライブラリを一人で作っていました．CPUホストコードではC++17をCUDAデバイスコードではC++14を使っていたので，型安全にジェネリックなコードを書き，shared_ptrを使って安全にコードを書いていましたが，ときどき循環参照を起こしてメモリリークを起こしてGCが欲しくなったり，SFINAEに頼ってジェネリックなコードを書くのに辛くなってきました．そんな中でGCがあり，SFINAEに頼らない簡単・自然なメタプログラミング機能を使えるD言語を使いたい気持ちは日に日に高まっていきました．
</p>

<p>
そんな中，10連休に及ぶGWは仕事のことは忘れて虚無に過ごしたのですが，最終日に突如として<a href="https://github.com/libmir/dcompute">dcompute</a>というD言語でCUDAカーネルを書く謎の技術を思い出し，触ってみました．結果から言うとコンパイルすらできなかったのですが&#x2026;．いろいろ調べるとデバイス側のポインタの扱いやカーネル生成など大部分はすでにLDC本家にマージされており，若干の便利機能が残った部分がdcomputeライブラリとして残っていました．少し古いですが以下のページ
</p>

<ul class="org-ul">
<li>CUDA Driver APIのD言語ラッパー <a href="https://github.com/DerelictOrg/DerelictCUDA/blob/master/source/derelict/cuda/driverapi.d">DerelictCUDA</a></li>
<li><a href="https://github.com/ldc-developers/ldc/blob/085d9a69db42a608759aea638b388f2149dd629a/tests/codegen/dcompute_cu_addrspaces.d#L3">LDCのCUDAカーネルからのPTX生成のテストコード</a></li>
<li><a href="https://llvm.org/docs/NVPTXUsage.html#llvm-nvvm-ptr-to-gen-intrinsics">LLVMのPTXコード生成の仕組み</a></li>
<li><a href="https://llvm.org/docs/CompileCudaWithLLVM.html">ClangでCUDAバイナリをコンパイルする方法</a></li>
</ul>

<p>
を参考にしてMakefileからldc2コマンドを直に叩いてD言語からCUDAの中間コードであるPTXを生成し，dcomputeのexampleはよくわからないのでCUDA Driver APIで呼び出すことにしました．
</p>

<div class="org-src-container">
<pre class="src src-makefile"><span style="color: #8700af; font-weight: bold;">kernel/%.ptx</span>: kernel/%.d tool/compute_capability.out
    ldc2 $<span style="color: #8700af;">&lt;</span> --mdcompute-targets=cuda-$<span style="color: #268bd2;">(</span><span style="color: #af5fd7;">CUDA_COMPUTE_CAPABILITY</span><span style="color: #268bd2;">)</span><span style="color: #8700af;">0</span> -H -Hd kernel -mdcompute-file-prefix=$<span style="color: #268bd2;">(</span><span style="color: #af5fd7;">shell</span> basename -s .d $<span style="color: #8700af;">&lt;</span><span style="color: #268bd2;">)</span>
    mv $<span style="color: #268bd2;">(</span><span style="color: #af5fd7;">shell</span> basename -s .d $<span style="color: #8700af;">&lt;</span><span style="color: #268bd2;">)</span>_cuda$<span style="color: #268bd2;">(</span><span style="color: #af5fd7;">CUDA_COMPUTE_CAPABILITY</span><span style="color: #268bd2;">)</span><span style="color: #8700af;">0_</span>$<span style="color: #268bd2;">(</span><span style="color: #af5fd7;">CUDA_BIT</span><span style="color: #268bd2;">)</span>.ptx <span style="color: #8700af; font-weight: bold;">$</span><span style="color: #8700af; font-weight: bold;">@</span>
</pre>
</div>

<p>
上記のコマンドでは，PTXファイル <code>(モジュール名).ptx</code> だけでなく，D言語のヘッダー定義 <code>(モジュール名).di</code> を生成して，PTXのJITコンパイル後の関数呼び出しにおける静的型検査に使おうと考えました(これは最後まで実装していないが，<a href="https://github.com/ShigekiKarita/d-nv/blob/master/source/dnv/typechecker.d">NVRTCラッパーを作ったときに同じことを</a>以前やったので，そんなに難しくないと思います)．
</p>

<p>
この日はCUDA入門で最初にやるベクトル加算(axpy)の実装と実行まで動いています．困った点として，CUDA Driver APIにあるコンテキスト <code>cuContext</code> を破棄するタイミングが，GCより前に起こってしまい，いくつかのCUDA関係のオブジェクトのデストラクタがGCによってCUDA関係のDestroy/Free系関数を呼んでうまく開放できませんでした．簡単な解決策として， <code>cuContext</code> の破棄の前に明示的にGCを呼ぶことで回避しました．
</p>

<div class="org-src-container">
<pre class="src src-d"><span style="color: #268bd2; font-weight: bold;">module</span> grain.<span style="color: #8700af;">cuda</span>;

...

<span style="color: #268bd2; font-weight: bold;">shared</span> <span style="color: #268bd2; font-weight: bold;">static</span> ~<span style="color: #268bd2; font-weight: bold;">this</span><span style="color: #268bd2;">()</span> <span style="color: #268bd2;">{</span>
    <span style="color: #268bd2; font-weight: bold;">import</span> core.<span style="color: #af005f; font-weight: bold;">memory</span> : GC;
    GC.collect<span style="color: #8700af;">()</span>;
    checkCudaErrors<span style="color: #8700af;">(</span>cuCtxDestroy<span style="color: #2aa198;">(</span>context<span style="color: #2aa198;">)</span><span style="color: #8700af;">)</span>;
<span style="color: #268bd2;">}</span>
</pre>
</div>

<p>
3日目くらいで作業メモを残そうと思い，この文書を書き始めてタイトルには1週間と書いてみましたが，この期間は普通に働いているので一日2-5時間程度の作業時間でした．なおリポジトリは下記の通りで，git cloneしてmakeを叩けばテストまで走ります，動作していたDコンパイラは<a href="https://github.com/ldc-developers/ldc/releases/tag/v1.9.0">LDC1.9.0</a>(Linux X64)です．
</p>

<ul class="org-ul">
<li>この日の最終 commit  <a href="https://github.com/ShigekiKarita/grain/tree/54c0c6b390c3258dcb80c5868cd3304387c6abdc">https://github.com/ShigekiKarita/grain/tree/54c0c6b390c3258dcb80c5868cd3304387c6abdc</a></li>
</ul>
</div>
</div>
