notes/d-deep-learning.org
* CPUホスト・CUDAデバイスそれぞれのメモリ管理 (2日目, 5/8)

とりあえずCUDAは ~CuPtr(T)~ というホストだと ~T[]~ に相当するCUDA配列の構造体を作りました．この構造体はデバイス上のアドレス ~cuDeviceptr ptr~ と長さ ~size_t length~ のペアです．メソッドとしてはCPUメモリからのコピーコンストラクタ ~this(T[] host)~ と，デバイスメモリをコピーする ~CuPtr!T dup()~ を追加．(参照の)コピーコンストラクタは ~@disable this(this);~ として無効化しました，これは経験上GCによるCUDAデバイスメモリの管理は悲惨なことになるので...．実際にはGCの代わりに標準ライブラリにある参照カウンタ ~RefCounted(T)~ を使うことで管理する方針．[[https://www.cs.virginia.edu/~mwb7w/cuda_support/memory_management_overhead.html][CUDAはmalloc/freeのコストが高い]]ので，いずれはメモリプールなどを実装したいですね．

#+begin_src d
struct CuPtr(T) {
    import derelict.cuda;
    CUdeviceptr ptr;
    size_t length;

    this(CUdeviceptr p, size_t l) {
        this.ptr = p;
        this.length = l;
    }

    this(size_t n) {
        this.length = n;
        checkCudaErrors(cuMemAlloc(&ptr, T.sizeof * n));
    }

    this(T[] host) {
        this(host.length);
        checkCudaErrors(cuMemcpyHtoD(ptr, &host[0], T.sizeof * length));
    }

    @disable this(this); // not copyable

    ~this() {
        checkCudaErrors(cuMemFree(ptr));
    }

    auto dup() {
        CUdeviceptr ret;
        checkCudaErrors(cuMemAlloc(&ret, T.sizeof * length));
        checkCudaErrors(cuMemcpyDtoD(ret, ptr, T.sizeof * length));
        return typeof(this)(ret, length);
    }

    ref toHost(ref T[] host) {
        host.length = length;
        checkCudaErrors(cuMemcpyDtoH(&host[0], ptr, T.sizeof * length));
        return host;
    }

    auto toHost() {
        auto host = new T[length];
        checkCudaErrors(cuMemcpyDtoH(&host[0], ptr, T.sizeof * length));
        return host;
    }
}
#+end_src

ゆくゆくはGCが管理する動的配列 ~T[]~ ではなく，malloc/freeで自前で管理した配列を使いたいのですが，どうせ後でMirを使うことになるので，自作はやめてGCの動的配列を使うことにしました．いずれ参照カウンタ付のmalloc/freeで確保・開放するMir配列([[http://mir.dlang.io/mir_ndslice_allocation.html#stdcSlice][stdcSlice]])を使うことにします．

- この日の最終 commit https://github.com/ShigekiKarita/grain/tree/e58940b2b18b921e0cc22f86511e67e245e0b13b

* 虚無 (3日目, 5/9)

この日は泊りがけの出張で新幹線の中で少しだけ作業した...気がしていたが，変数名を変えたくらいでした．ノートPCにはCUDA対応デバイスがなく，ましてOpenCLも動かす気にはならなかったので，D言語の[[https://dlang.org/spec/version.html][条件コンパイル]]機能でCUDAが必要な部分を以下のように指定したいなと思った．

#+begin_src d
version (grain_cuda) {
   // CUDA依存のコード
}
#+end_src

どうやってユーザ定義のversionを作るのかわからなかったので，困ったときのmir-algorithmリポジトリの[[https://github.com/libmir/mir-algorithm/blob/master/dub.json][dub.json]]を見ると

#+begin_src json
...
"buildTypes": {
  "unittest": {
     "buildOptions": ["unittests", "debugMode", "debugInfo"],
	 "versions": ["mir_test"]
  },
},
...
#+end_src

という記述があり，この例では ~mir_test~ というversionをunittestのとき (~dub --build=unittest~でビルドしたとき) に有効になるという具合でした．なのでCUDAを使う部分だけ ~grain_cuda~ のようなバージョン指定子で隔離すればCUDAのない環境でもCPU動作の部分だけ動かせると思いました．なお，その機能を実装したのは5日目．

- この日の最終 commit https://github.com/ShigekiKarita/grain/tree/e58940b2b18b921e0cc22f86511e67e245e0b13b

* CPUホスト・CUDAデバイス両対応な関数オブジェクト (4日目, 5/10)

前日の出張のせいで風邪を引いたので全体的にダラダラと妄想しただけでした．

