notes/d-deep-learning.html

<div id="outline-container-org0839f4d" class="outline-2">
<h2 id="org0839f4d"><span class="section-number-2">2</span> CPUホスト・CUDAデバイスそれぞれのメモリ管理 (2日目, 5/8)</h2>
<div class="outline-text-2" id="text-2">
<p>
とりあえずCUDAは <code>CuPtr(T)</code> というホストだと <code>T[]</code> に相当するCUDA配列の構造体を作りました．この構造体はデバイス上のアドレス <code>cuDeviceptr ptr</code> と長さ <code>size_t length</code> のペアです．メソッドとしてはCPUメモリからのコピーコンストラクタ <code>this(T[] host)</code> と，デバイスメモリをコピーする <code>CuPtr!T dup()</code> を追加．(参照の)コピーコンストラクタは <code>@disable this(this);</code> として無効化しました，これは経験上GCによるCUDAデバイスメモリの管理は悲惨なことになるので&#x2026;．実際にはGCの代わりに標準ライブラリにある参照カウンタ <code>RefCounted(T)</code> を使うことで管理する方針．<a href="https://www.cs.virginia.edu/~mwb7w/cuda_support/memory_management_overhead.html">CUDAはmalloc/freeのコストが高い</a>ので，いずれはメモリプールなどを実装したいですね．
</p>

<div class="org-src-container">
<pre class="src src-d"><span style="color: #268bd2; font-weight: bold;">struct</span> <span style="color: #af005f; font-weight: bold;">CuPtr</span><span style="color: #268bd2;">(</span><span style="color: #af005f; font-weight: bold;">T</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span>
    <span style="color: #268bd2; font-weight: bold;">import</span> derelict.<span style="color: #af005f; font-weight: bold;">cuda</span>;
    <span style="color: #af005f; font-weight: bold;">CUdeviceptr</span> <span style="color: #af5fd7;">ptr</span>;
    <span style="color: #af005f; font-weight: bold;">size_t</span> <span style="color: #af5fd7;">length</span>;

    <span style="color: #268bd2; font-weight: bold;">this</span><span style="color: #8700af;">(</span><span style="color: #af005f; font-weight: bold;">CUdeviceptr</span> <span style="color: #af5fd7;">p</span>, <span style="color: #af005f; font-weight: bold;">size_t</span> <span style="color: #af5fd7;">l</span><span style="color: #8700af;">)</span> <span style="color: #8700af;">{</span>
        <span style="color: #268bd2; font-weight: bold;">this</span>.ptr = p;
        <span style="color: #268bd2; font-weight: bold;">this</span>.length = l;
    <span style="color: #8700af;">}</span>

    <span style="color: #268bd2; font-weight: bold;">this</span><span style="color: #8700af;">(</span><span style="color: #af005f; font-weight: bold;">size_t</span> <span style="color: #af5fd7;">n</span><span style="color: #8700af;">)</span> <span style="color: #8700af;">{</span>
        <span style="color: #268bd2; font-weight: bold;">this</span>.length = n;
        checkCudaErrors<span style="color: #2aa198;">(</span>cuMemAlloc<span style="color: #5faf00;">(</span>&amp;ptr, T.<span style="color: #268bd2; font-weight: bold;">sizeof</span> * n<span style="color: #5faf00;">)</span><span style="color: #2aa198;">)</span>;
    <span style="color: #8700af;">}</span>

    <span style="color: #268bd2; font-weight: bold;">this</span><span style="color: #8700af;">(</span><span style="color: #af005f; font-weight: bold;">T</span><span style="color: #2aa198;">[]</span> <span style="color: #af5fd7;">host</span><span style="color: #8700af;">)</span> <span style="color: #8700af;">{</span>
        <span style="color: #268bd2; font-weight: bold;">this</span><span style="color: #2aa198;">(</span>host.length<span style="color: #2aa198;">)</span>;
        checkCudaErrors<span style="color: #2aa198;">(</span>cuMemcpyHtoD<span style="color: #5faf00;">(</span>ptr, &amp;host<span style="color: #875f00;">[</span><span style="color: #8700af;">0</span><span style="color: #875f00;">]</span>, T.<span style="color: #268bd2; font-weight: bold;">sizeof</span> * length<span style="color: #5faf00;">)</span><span style="color: #2aa198;">)</span>;
    <span style="color: #8700af;">}</span>

    <span style="color: #8700af;">@disable</span> <span style="color: #268bd2; font-weight: bold;">this</span><span style="color: #8700af;">(</span><span style="color: #268bd2; font-weight: bold;">this</span><span style="color: #8700af;">)</span>; <span style="color: #008787; background-color: #ffffff;">// </span><span style="color: #008787; background-color: #ffffff;">not copyable</span>

    ~<span style="color: #268bd2; font-weight: bold;">this</span><span style="color: #8700af;">()</span> <span style="color: #8700af;">{</span>
        checkCudaErrors<span style="color: #2aa198;">(</span>cuMemFree<span style="color: #5faf00;">(</span>ptr<span style="color: #5faf00;">)</span><span style="color: #2aa198;">)</span>;
    <span style="color: #8700af;">}</span>

    <span style="color: #268bd2; font-weight: bold;">auto</span> <span style="color: #8700af; font-weight: bold;">dup</span><span style="color: #8700af;">()</span> <span style="color: #8700af;">{</span>
        <span style="color: #af005f; font-weight: bold;">CUdeviceptr</span> <span style="color: #af5fd7;">ret</span>;
        checkCudaErrors<span style="color: #2aa198;">(</span>cuMemAlloc<span style="color: #5faf00;">(</span>&amp;ret, T.<span style="color: #268bd2; font-weight: bold;">sizeof</span> * length<span style="color: #5faf00;">)</span><span style="color: #2aa198;">)</span>;
        checkCudaErrors<span style="color: #2aa198;">(</span>cuMemcpyDtoD<span style="color: #5faf00;">(</span>ret, ptr, T.<span style="color: #268bd2; font-weight: bold;">sizeof</span> * length<span style="color: #5faf00;">)</span><span style="color: #2aa198;">)</span>;
        <span style="color: #268bd2; font-weight: bold;">return</span> <span style="color: #268bd2; font-weight: bold;">typeof</span><span style="color: #2aa198;">(</span><span style="color: #268bd2; font-weight: bold;">this</span><span style="color: #2aa198;">)(</span>ret, length<span style="color: #2aa198;">)</span>;
    <span style="color: #8700af;">}</span>

    <span style="color: #268bd2; font-weight: bold;">ref</span> <span style="color: #8700af; font-weight: bold;">toHost</span><span style="color: #8700af;">(</span><span style="color: #268bd2; font-weight: bold;">ref</span> <span style="color: #af005f; font-weight: bold;">T</span><span style="color: #2aa198;">[]</span> <span style="color: #af5fd7;">host</span><span style="color: #8700af;">)</span> <span style="color: #8700af;">{</span>
        host.length = length;
        checkCudaErrors<span style="color: #2aa198;">(</span>cuMemcpyDtoH<span style="color: #5faf00;">(</span>&amp;host<span style="color: #875f00;">[</span><span style="color: #8700af;">0</span><span style="color: #875f00;">]</span>, ptr, T.<span style="color: #268bd2; font-weight: bold;">sizeof</span> * length<span style="color: #5faf00;">)</span><span style="color: #2aa198;">)</span>;
        <span style="color: #268bd2; font-weight: bold;">return</span> host;
    <span style="color: #8700af;">}</span>

    <span style="color: #268bd2; font-weight: bold;">auto</span> <span style="color: #8700af; font-weight: bold;">toHost</span><span style="color: #8700af;">()</span> <span style="color: #8700af;">{</span>
        <span style="color: #268bd2; font-weight: bold;">auto</span> <span style="color: #af5fd7;">host</span> = <span style="color: #268bd2; font-weight: bold;">new</span> T<span style="color: #2aa198;">[</span>length<span style="color: #2aa198;">]</span>;
        checkCudaErrors<span style="color: #2aa198;">(</span>cuMemcpyDtoH<span style="color: #5faf00;">(</span>&amp;host<span style="color: #875f00;">[</span><span style="color: #8700af;">0</span><span style="color: #875f00;">]</span>, ptr, T.<span style="color: #268bd2; font-weight: bold;">sizeof</span> * length<span style="color: #5faf00;">)</span><span style="color: #2aa198;">)</span>;
        <span style="color: #268bd2; font-weight: bold;">return</span> host;
    <span style="color: #8700af;">}</span>
<span style="color: #268bd2;">}</span>
</pre>
</div>

<p>
ゆくゆくはGCが管理する動的配列 <code>T[]</code> ではなく，malloc/freeで自前で管理した配列を使いたいのですが，どうせ後でMirを使うことになるので，自作はやめてGCの動的配列を使うことにしました．いずれ参照カウンタ付のmalloc/freeで確保・開放するMir配列(<a href="http://mir.dlang.io/mir_ndslice_allocation.html#stdcSlice">stdcSlice</a>)を使うことにします．
</p>

<ul class="org-ul">
<li>この日の最終 commit <a href="https://github.com/ShigekiKarita/grain/tree/e58940b2b18b921e0cc22f86511e67e245e0b13b">https://github.com/ShigekiKarita/grain/tree/e58940b2b18b921e0cc22f86511e67e245e0b13b</a></li>
</ul>
</div>
</div>

<div id="outline-container-org68f36f1" class="outline-2">
<h2 id="org68f36f1"><span class="section-number-2">3</span> 虚無 (3日目, 5/9)</h2>
<div class="outline-text-2" id="text-3">
<p>
この日は泊りがけの出張で新幹線の中で少しだけ作業した&#x2026;気がしていたが，変数名を変えたくらいでした．ノートPCにはCUDA対応デバイスがなく，ましてOpenCLも動かす気にはならなかったので，D言語の<a href="https://dlang.org/spec/version.html">条件コンパイル</a>機能でCUDAが必要な部分を以下のように指定したいなと思った．
</p>

<div class="org-src-container">
<pre class="src src-d"><span style="color: #268bd2; font-weight: bold;">version</span> <span style="color: #268bd2;">(</span>grain_cuda<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span>
   <span style="color: #008787; background-color: #ffffff;">// </span><span style="color: #008787; background-color: #ffffff;">CUDA&#20381;&#23384;&#12398;&#12467;&#12540;&#12489;</span>
<span style="color: #268bd2;">}</span>
</pre>
</div>

<p>
どうやってユーザ定義のversionを作るのかわからなかったので，困ったときのmir-algorithmリポジトリの<a href="https://github.com/libmir/mir-algorithm/blob/master/dub.json">dub.json</a>を見ると
</p>

<div class="org-src-container">
<pre class="src src-json">...
<span style="color: #268bd2; font-weight: bold;">"buildTypes"</span>: <span style="color: #268bd2;">{</span>
  <span style="color: #268bd2; font-weight: bold;">"unittest"</span>: <span style="color: #8700af;">{</span>
     <span style="color: #268bd2; font-weight: bold;">"buildOptions"</span>: <span style="color: #2aa198;">[</span><span style="color: #2aa198;">"unittests"</span>, <span style="color: #2aa198;">"debugMode"</span>, <span style="color: #2aa198;">"debugInfo"</span><span style="color: #2aa198;">]</span>,
     <span style="color: #268bd2; font-weight: bold;">"versions"</span>: <span style="color: #2aa198;">[</span><span style="color: #2aa198;">"mir_test"</span><span style="color: #2aa198;">]</span>
  <span style="color: #8700af;">}</span>,
<span style="color: #268bd2;">}</span>,
...
</pre>
</div>

<p>
という記述があり，この例では <code>mir_test</code> というversionをunittestのとき (<code>dub --build=unittest~でビルドしたとき) に有効になるという具合でした．なのでCUDAを使う部分だけ ~grain_cuda</code> のようなバージョン指定子で隔離すればCUDAのない環境でもCPU動作の部分だけ動かせると思いました．なお，その機能を実装したのは5日目．
</p>

<ul class="org-ul">
<li>この日の最終 commit <a href="https://github.com/ShigekiKarita/grain/tree/e58940b2b18b921e0cc22f86511e67e245e0b13b">https://github.com/ShigekiKarita/grain/tree/e58940b2b18b921e0cc22f86511e67e245e0b13b</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgda63ca3" class="outline-2">
<h2 id="orgda63ca3"><span class="section-number-2">4</span> CPUホスト・CUDAデバイス両対応な関数オブジェクト (4日目, 5/10)</h2>
<div class="outline-text-2" id="text-4">
<p>
前日の出張のせいで風邪を引いたので全体的にダラダラと妄想しただけでした．
</p>
</div>
