notes/d-deep-learning.html

<div id="outline-container-org57fdeb7" class="outline-3">
<h3 id="org57fdeb7"><span class="section-number-3">4.1</span> Function 関数オブジェクト</h3>
<div class="outline-text-3" id="text-4-1">
<p>
4日目にしてようやくDeep learningっぽいことを考え始めるのですが，自動微分可能な関数の設計を考えました．思えば私が一番設計がシンプルで好きな(=私が理解できた)既存のフレームワークはChainerのversion 1でした．今のChainerは色々なトレードオフで，v1ほどは綺麗ではないと思います(例えばPytorchもChainer v1を参考に作られています)．Chainer v1の素晴らしかったことは
</p>

<ol class="org-ol">
<li>動的な計算グラフ(define by run)を考案した</li>
<li>ユーザ定義のFuncitonが簡単にかけた</li>
<li>全てPythonで書かれていた (デバッグやコードの拡張が簡単)</li>
</ol>

<p>
ということではないかと思うのですが，3番目の全てPythonで書かれていたというのは素晴らしくないことでもあり，静的型検査やネイティブコードの速さといった恩恵が，C++で書かれた他フレームワークのように受けられない点もまた人気が低い原因かなと思います．初日に述べたように私はC++で1,2の利点を持つライブラリを職場では作って使っているのですが，C++もときどき辛いことがあります．だからchainerのようなライブラリをD言語で作れば楽しいだろうなと思ったのです．
</p>

<p>
ところで，Chainer v1のFunctionを定義する場合はこんな感じでかけます．
</p>

<ul class="org-ul">
<li>from <a href="https://github.com/chainer/chainer/blob/v1/chainer/functions/activation/relu.py">https://github.com/chainer/chainer/blob/v1/chainer/functions/activation/relu.py</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2; font-weight: bold;">class</span> <span style="color: #af005f; font-weight: bold;">ReLU</span><span style="color: #268bd2;">(</span>function.Function<span style="color: #268bd2;">)</span>:

    <span style="color: #008787;">"""Rectified Linear Unit."""</span>
    <span style="color: #008787; background-color: #ffffff;"># </span><span style="color: #cc9393;">TODO</span><span style="color: #008787; background-color: #ffffff;">(beam2d): Implement in-place version.</span>

    <span style="color: #268bd2; font-weight: bold;">def</span> <span style="color: #8700af; font-weight: bold;">__init__</span><span style="color: #268bd2;">(</span><span style="color: #268bd2; font-weight: bold;">self</span>, use_cudnn=<span style="color: #8700af;">True</span><span style="color: #268bd2;">)</span>:
        <span style="color: #268bd2; font-weight: bold;">self</span>.use_cudnn = use_cudnn

    <span style="color: #268bd2; font-weight: bold;">def</span> <span style="color: #8700af; font-weight: bold;">check_type_forward</span><span style="color: #268bd2;">(</span><span style="color: #268bd2; font-weight: bold;">self</span>, in_types<span style="color: #268bd2;">)</span>:
        type_check.expect<span style="color: #268bd2;">(</span>
            in_types.size<span style="color: #8700af;">()</span> == <span style="color: #8700af;">1</span>,
            in_types<span style="color: #8700af;">[</span><span style="color: #8700af;">0</span><span style="color: #8700af;">]</span>.dtype.kind == <span style="color: #2aa198;">'f'</span>,
        <span style="color: #268bd2;">)</span>

    <span style="color: #268bd2; font-weight: bold;">def</span> <span style="color: #8700af; font-weight: bold;">forward_cpu</span><span style="color: #268bd2;">(</span><span style="color: #268bd2; font-weight: bold;">self</span>, x<span style="color: #268bd2;">)</span>:
        <span style="color: #268bd2; font-weight: bold;">return</span> utils.force_array<span style="color: #268bd2;">(</span>numpy.maximum<span style="color: #8700af;">(</span>x<span style="color: #2aa198;">[</span><span style="color: #8700af;">0</span><span style="color: #2aa198;">]</span>, <span style="color: #8700af;">0</span>, dtype=x<span style="color: #2aa198;">[</span><span style="color: #8700af;">0</span><span style="color: #2aa198;">]</span>.dtype<span style="color: #8700af;">)</span><span style="color: #268bd2;">)</span>,

    <span style="color: #268bd2; font-weight: bold;">def</span> <span style="color: #8700af; font-weight: bold;">forward_gpu</span><span style="color: #268bd2;">(</span><span style="color: #268bd2; font-weight: bold;">self</span>, x<span style="color: #268bd2;">)</span>:
        <span style="color: #268bd2; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>cuda.cudnn_enabled <span style="color: #268bd2; font-weight: bold;">and</span> <span style="color: #268bd2; font-weight: bold;">self</span>.use_cudnn <span style="color: #268bd2; font-weight: bold;">and</span>
                x<span style="color: #8700af;">[</span><span style="color: #8700af;">0</span><span style="color: #8700af;">]</span>.flags.c_contiguous <span style="color: #268bd2; font-weight: bold;">and</span>
                <span style="color: #8700af;">(</span>_cudnn_version &gt;= <span style="color: #8700af;">3000</span> <span style="color: #268bd2; font-weight: bold;">or</span> x<span style="color: #2aa198;">[</span><span style="color: #8700af;">0</span><span style="color: #2aa198;">]</span>.dtype != numpy.float16<span style="color: #8700af;">)</span><span style="color: #268bd2;">)</span>:
            <span style="color: #af5fd7;">y</span> = cudnn.activation_forward<span style="color: #268bd2;">(</span>x<span style="color: #8700af;">[</span><span style="color: #8700af;">0</span><span style="color: #8700af;">]</span>, _mode<span style="color: #268bd2;">)</span>
            <span style="color: #268bd2; font-weight: bold;">self</span>.y = y
        <span style="color: #268bd2; font-weight: bold;">else</span>:
            <span style="color: #af5fd7;">y</span> = cuda.cupy.maximum<span style="color: #268bd2;">(</span>x<span style="color: #8700af;">[</span><span style="color: #8700af;">0</span><span style="color: #8700af;">]</span>, <span style="color: #8700af;">0</span><span style="color: #268bd2;">)</span>
        <span style="color: #268bd2; font-weight: bold;">return</span> y,

    <span style="color: #268bd2; font-weight: bold;">def</span> <span style="color: #8700af; font-weight: bold;">backward_cpu</span><span style="color: #268bd2;">(</span><span style="color: #268bd2; font-weight: bold;">self</span>, x, gy<span style="color: #268bd2;">)</span>:
        <span style="color: #268bd2; font-weight: bold;">return</span> utils.force_array<span style="color: #268bd2;">(</span>gy<span style="color: #8700af;">[</span><span style="color: #8700af;">0</span><span style="color: #8700af;">]</span> * <span style="color: #8700af;">(</span>x<span style="color: #2aa198;">[</span><span style="color: #8700af;">0</span><span style="color: #2aa198;">]</span> &gt; <span style="color: #8700af;">0</span><span style="color: #8700af;">)</span><span style="color: #268bd2;">)</span>,

    <span style="color: #268bd2; font-weight: bold;">def</span> <span style="color: #8700af; font-weight: bold;">backward_gpu</span><span style="color: #268bd2;">(</span><span style="color: #268bd2; font-weight: bold;">self</span>, x, gy<span style="color: #268bd2;">)</span>:
        <span style="color: #268bd2; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>cuda.cudnn_enabled <span style="color: #268bd2; font-weight: bold;">and</span> <span style="color: #268bd2; font-weight: bold;">self</span>.use_cudnn <span style="color: #268bd2; font-weight: bold;">and</span>
                x<span style="color: #8700af;">[</span><span style="color: #8700af;">0</span><span style="color: #8700af;">]</span>.flags.c_contiguous <span style="color: #268bd2; font-weight: bold;">and</span> gy<span style="color: #8700af;">[</span><span style="color: #8700af;">0</span><span style="color: #8700af;">]</span>.flags.c_contiguous <span style="color: #268bd2; font-weight: bold;">and</span>
                <span style="color: #8700af;">(</span>_cudnn_version &gt;= <span style="color: #8700af;">3000</span> <span style="color: #268bd2; font-weight: bold;">or</span> x<span style="color: #2aa198;">[</span><span style="color: #8700af;">0</span><span style="color: #2aa198;">]</span>.dtype != numpy.float16<span style="color: #8700af;">)</span><span style="color: #268bd2;">)</span>:
            <span style="color: #af5fd7;">gx</span> = cudnn.activation_backward<span style="color: #268bd2;">(</span>x<span style="color: #8700af;">[</span><span style="color: #8700af;">0</span><span style="color: #8700af;">]</span>, <span style="color: #268bd2; font-weight: bold;">self</span>.y, gy<span style="color: #8700af;">[</span><span style="color: #8700af;">0</span><span style="color: #8700af;">]</span>, _mode<span style="color: #268bd2;">)</span>
        <span style="color: #268bd2; font-weight: bold;">else</span>:
            <span style="color: #af5fd7;">gx</span> = cuda.elementwise<span style="color: #268bd2;">(</span>
                <span style="color: #2aa198;">'T x, T gy'</span>, <span style="color: #2aa198;">'T gx'</span>,
                <span style="color: #2aa198;">'gx = x &gt; 0 ? gy : (T)0'</span>,
                <span style="color: #2aa198;">'relu_bwd'</span><span style="color: #268bd2;">)(</span>x<span style="color: #8700af;">[</span><span style="color: #8700af;">0</span><span style="color: #8700af;">]</span>, gy<span style="color: #8700af;">[</span><span style="color: #8700af;">0</span><span style="color: #8700af;">]</span><span style="color: #268bd2;">)</span>
        <span style="color: #268bd2; font-weight: bold;">return</span> gx,
</pre>
</div>

<p>
これを真似して，こんな感じで書こうと思います．
</p>

<div class="org-src-container">
<pre class="src src-d"><span style="color: #268bd2; font-weight: bold;">class</span> <span style="color: #af005f; font-weight: bold;">ReLU</span><span style="color: #268bd2;">(</span><span style="color: #af005f; font-weight: bold;">T</span>, <span style="color: #af005f; font-weight: bold;">size_t</span> <span style="color: #af5fd7;">dim</span><span style="color: #268bd2;">)</span> : Function <span style="color: #268bd2; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>isFloatingPoint<span style="color: #8700af;">!</span>T<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span>
    <span style="color: #af005f; font-weight: bold;">bool</span> <span style="color: #af5fd7;">inplace</span> = <span style="color: #8700af;">false</span>;

    <span style="color: #268bd2; font-weight: bold;">auto</span> <span style="color: #8700af; font-weight: bold;">forward</span><span style="color: #8700af;">(</span>Variable<span style="color: #8700af;">!</span><span style="color: #2aa198;">(</span><span style="color: #af005f; font-weight: bold;">T</span>, <span style="color: #af005f; font-weight: bold;">dim</span>, <span style="color: #af005f; font-weight: bold;">HostStorage</span><span style="color: #2aa198;">)</span> x<span style="color: #8700af;">)</span> <span style="color: #8700af;">{</span>
        <span style="color: #268bd2; font-weight: bold;">import</span> mir.<span style="color: #af005f; font-weight: bold;">ndslice</span> : each;
        <span style="color: #268bd2; font-weight: bold;">auto</span> <span style="color: #af5fd7;">y</span> = <span style="color: #268bd2; font-weight: bold;">this</span>.inplace ? x : x.dup;
        y.sliced.each<span style="color: #8700af;">!</span><span style="color: #2aa198;">(</span><span style="color: #5faf00;">(</span><span style="color: #268bd2; font-weight: bold;">ref</span> <span style="color: #af005f; font-weight: bold;">a</span><span style="color: #5faf00;">)</span> <span style="color: #5faf00;">{</span> <span style="color: #268bd2; font-weight: bold;">if</span> <span style="color: #875f00;">(</span>a &lt; <span style="color: #8700af;">0</span><span style="color: #875f00;">)</span> a = <span style="color: #8700af;">0</span>; <span style="color: #5faf00;">}</span><span style="color: #2aa198;">)</span>;
        <span style="color: #268bd2; font-weight: bold;">return</span> y;
    <span style="color: #8700af;">}</span>

    <span style="color: #268bd2; font-weight: bold;">auto</span> <span style="color: #8700af; font-weight: bold;">backward</span><span style="color: #8700af;">(</span>Variable<span style="color: #8700af;">!</span><span style="color: #2aa198;">(</span><span style="color: #af005f; font-weight: bold;">T</span>, <span style="color: #af005f; font-weight: bold;">dim</span>, <span style="color: #af005f; font-weight: bold;">HostStorage</span><span style="color: #2aa198;">)</span> gy, Variable<span style="color: #8700af;">!</span><span style="color: #2aa198;">(</span><span style="color: #af005f; font-weight: bold;">T</span>, <span style="color: #af005f; font-weight: bold;">dim</span>, <span style="color: #af005f; font-weight: bold;">HostStorage</span><span style="color: #2aa198;">)</span> x<span style="color: #8700af;">)</span> <span style="color: #8700af;">{</span>
        <span style="color: #268bd2; font-weight: bold;">auto</span> <span style="color: #af5fd7;">gx</span> = gy.dup;
        <span style="color: #268bd2; font-weight: bold;">foreach</span> <span style="color: #2aa198;">(</span>i; <span style="color: #8700af;">0</span>..gx.data.length<span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
            <span style="color: #268bd2; font-weight: bold;">if</span> <span style="color: #5faf00;">(</span>x.data<span style="color: #875f00;">[</span>i<span style="color: #875f00;">]</span> &lt; <span style="color: #8700af;">0</span>.<span style="color: #8700af;">0</span><span style="color: #5faf00;">)</span> gx.data<span style="color: #5faf00;">[</span>i<span style="color: #5faf00;">]</span> = <span style="color: #8700af;">0</span>.<span style="color: #8700af;">0</span>;
        <span style="color: #2aa198;">}</span>
        <span style="color: #268bd2; font-weight: bold;">return</span> gx;
    <span style="color: #8700af;">}</span>

    <span style="color: #268bd2; font-weight: bold;">version</span><span style="color: #8700af;">(</span>grain_cuda<span style="color: #8700af;">)</span> <span style="color: #8700af;">{</span>
        <span style="color: #268bd2; font-weight: bold;">auto</span> <span style="color: #8700af; font-weight: bold;">forward</span><span style="color: #2aa198;">(</span>Variable<span style="color: #8700af;">!</span><span style="color: #5faf00;">(</span><span style="color: #af005f; font-weight: bold;">T</span>, <span style="color: #af005f; font-weight: bold;">dim</span>, <span style="color: #af005f; font-weight: bold;">DeviceStorage</span><span style="color: #5faf00;">)</span> x<span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
            <span style="color: #268bd2; font-weight: bold;">import</span> grain.<span style="color: #af005f; font-weight: bold;">kernel</span> : relu;
            <span style="color: #268bd2; font-weight: bold;">auto</span> <span style="color: #af5fd7;">y</span> = <span style="color: #268bd2; font-weight: bold;">this</span>.inplace ? x : x.dup;
            <span style="color: #268bd2; font-weight: bold;">auto</span> <span style="color: #af5fd7;">n</span> = <span style="color: #268bd2; font-weight: bold;">cast</span><span style="color: #5faf00;">(</span><span style="color: #af005f; font-weight: bold;">uint</span><span style="color: #5faf00;">)</span> y.data.length;
            Global.kernel<span style="color: #8700af;">!</span>relu
                .launch<span style="color: #5faf00;">(</span>y.data.ptr, n, <span style="color: #875f00;">[</span><span style="color: #8700af;">1</span>,<span style="color: #8700af;">1</span>,<span style="color: #8700af;">1</span><span style="color: #875f00;">]</span>, <span style="color: #875f00;">[</span>n,<span style="color: #8700af;">1</span>,<span style="color: #8700af;">1</span><span style="color: #875f00;">]</span><span style="color: #5faf00;">)</span>;
            <span style="color: #268bd2; font-weight: bold;">return</span> y;
        <span style="color: #2aa198;">}</span>

        <span style="color: #268bd2; font-weight: bold;">auto</span> <span style="color: #8700af; font-weight: bold;">backward</span><span style="color: #2aa198;">(</span>Variable<span style="color: #8700af;">!</span><span style="color: #5faf00;">(</span><span style="color: #af005f; font-weight: bold;">T</span>, <span style="color: #af005f; font-weight: bold;">dim</span>, <span style="color: #af005f; font-weight: bold;">DeviceStorage</span><span style="color: #5faf00;">)</span> gy, Variable<span style="color: #8700af;">!</span><span style="color: #5faf00;">(</span><span style="color: #af005f; font-weight: bold;">T</span>, <span style="color: #af005f; font-weight: bold;">dim</span>, <span style="color: #af005f; font-weight: bold;">DeviceStorage</span><span style="color: #5faf00;">)</span> x<span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
            <span style="color: #268bd2; font-weight: bold;">import</span> grain.<span style="color: #af005f; font-weight: bold;">kernel</span> : reluGrad;
            <span style="color: #268bd2; font-weight: bold;">auto</span> <span style="color: #af5fd7;">gx</span> = CuPtr<span style="color: #8700af;">!</span>T<span style="color: #5faf00;">(</span>gy.data.length<span style="color: #5faf00;">)</span>;
            <span style="color: #268bd2; font-weight: bold;">auto</span> <span style="color: #af5fd7;">n</span> = <span style="color: #268bd2; font-weight: bold;">cast</span><span style="color: #5faf00;">(</span><span style="color: #af005f; font-weight: bold;">uint</span><span style="color: #5faf00;">)</span> gy.data.length;
            Global.kernel<span style="color: #8700af;">!</span>reluGrad
                .launch<span style="color: #5faf00;">(</span>gx.data.ptr, gy.data.ptr, x.data.ptr, n, <span style="color: #875f00;">[</span><span style="color: #8700af;">1</span>,<span style="color: #8700af;">1</span>,<span style="color: #8700af;">1</span><span style="color: #875f00;">]</span>, <span style="color: #875f00;">[</span>n,<span style="color: #8700af;">1</span>,<span style="color: #8700af;">1</span><span style="color: #875f00;">]</span><span style="color: #5faf00;">)</span>;
            <span style="color: #268bd2; font-weight: bold;">return</span> gx;
        <span style="color: #2aa198;">}</span>
    <span style="color: #8700af;">}</span>
<span style="color: #268bd2;">}</span>
</pre>
</div>

<p>
ここで， <code>struct Variable(T, size_t dim, alias Storage)</code> という構造体は自動微分可能な多次元配列で，要素型(float, intなど) <code>T</code> と多次元配列の次元数(スカラ=0, ベクトル=1, 行列=2, &#x2026;), メモリの種類(CPUメモリ=HostStorage, CUDAメモリ=DeviceStorage)という型変数を持っています．Pythonと違って次元が合わないといった実行時エラーはおきません．ただし経験上，行や列などのサイズまで静的に指定するのは使いにくいのでやめました．もしかするとMirのndsliceのようにContiguousかどうかは静的に決まるので型に入れた方がパフォーマンス的に良いかもしれないですね．
</p>

<p>
あと <code>import grain.kernel : relu;</code> はD言語で書かれたカーネルのヘッダー定義で，元のコードはこんな感じで<a href="https://github.com/ShigekiKarita/grain/blob/8825341f9a1986d1916d6433ec4dd26562f2d977/kernel/kernel.d">kernel/kernel.d</a>に定義されています．
</p>

<div class="org-src-container">
<pre class="src src-d"><span style="color: #8700af;">@kernel</span> <span style="color: #af005f; font-weight: bold;">void</span> <span style="color: #8700af; font-weight: bold;">relu</span><span style="color: #268bd2;">(</span>GlobalPointer<span style="color: #8700af;">!</span><span style="color: #af005f; font-weight: bold;">float</span> x, <span style="color: #af005f; font-weight: bold;">size_t</span> <span style="color: #af5fd7;">N</span><span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span>
    <span style="color: #268bd2; font-weight: bold;">auto</span> <span style="color: #af5fd7;">i</span> = GlobalIndex.x;
    <span style="color: #268bd2; font-weight: bold;">if</span> <span style="color: #8700af;">(</span>i &gt;= N<span style="color: #8700af;">)</span> <span style="color: #268bd2; font-weight: bold;">return</span>;
    <span style="color: #268bd2; font-weight: bold;">if</span> <span style="color: #8700af;">(</span>x<span style="color: #2aa198;">[</span>i<span style="color: #2aa198;">]</span> &lt; <span style="color: #8700af;">0</span><span style="color: #8700af;">)</span> x<span style="color: #8700af;">[</span>i<span style="color: #8700af;">]</span> = <span style="color: #8700af;">0</span>;
<span style="color: #268bd2;">}</span>
</pre>
</div>

<p>
メリットとしては，デバイスのカーネル実装含めてD言語で全部シンプルに書かれている点と，きちんと引数の型が静的にチェックされるという点です．Deep learningのように何日も掛かる処理で実行時の型エラーに悩まされたくないのです&#x2026;．
</p>
</div>
</div>
