notes/d-deep-learning.org
** BLASライブラリの導入

さすがに自前で行列演算までは実装したくないので，Mirの人が作ってくれたndslice用のBLASラッパー[[https://github.com/kaleidicassociates/lubeck][lubeck]]と，以前に作った[[https://github.com/ShigekiKarita/d-nv/blob/7946c12c5657d0a9e73167792d1565f2f1474e86/source/dnv/cuda/cublas.d#L1][cuBLASラッパー]]を使うことにしました．CPU用のBLASのバックエンドは[[https://shigekikarita.github.io/blog/2017/10/27/001.html][経験的に速いIntel MKL]]を使います．

- この日の最終 commit (とくに変更はない) https://github.com/ShigekiKarita/grain/tree/e58940b2b18b921e0cc22f86511e67e245e0b13b


* シンプルな自動微分メカニズムと型消去 (5日目, 5/11)

出張先の神奈川が京都と比べて寒すぎた．風邪を引いて一日中寝てたので，大まかな設計を考えて，3,4日目に考えたCUDA依存の条件コンパイルと自動微分関数(ReLU, MatMul)を実装した．

** 自動微分の仕組み

多層ニューラルネットワークの自動微分は，合成関数の導関数=[[https://ja.wikipedia.org/wiki/%E9%80%A3%E9%8E%96%E5%BE%8B][微分の連鎖律]]によって成り立っている．

\begin{align}
y &= f(g(x)) \\
\frac{\partial f}{\partial x} &= \frac{\partial f}{\partial g}\frac{\partial g}{\partial x}
\end{align}

例えば一層目のニューラルネットワーク(=パラメータ行列によるアフィン変換とReLUなどの非線形変換の合成関数)を $g$, 二層目を $f$ と書くと，損失関数をLとすると入力 $x$ に対する損失値は $L(f(g(x)))$ として表されます．このような多層ニューラルネットに対して損失値を最小化するためには backprop と呼ばれる効率的なアルゴリズムがあります．

- 二層目を $f(x) -= \frac{\partial L}{\partial f}$ となるように，さらに連鎖律でアフィン変換のパラメータ行列の勾配までもとめて更新する．
- 一層目を $g(x) -= \frac{\partial L}{\partial f}\frac{\partial f}{\partial g}$ となるように更新する．ここで， $\frac{\partial L}{\partial f}$ は二層で求めた値なので，そのまま効率よく使いまわせます．この手順を逆伝搬=backpropといいます．

backpropに必要な実装として，

- $L(f(g(x)))$ のように変数が L <- f <- g として作られてきた連鎖の履歴として有向グラフ(複数の変数から1つの変数が作られたりするのでリストではない)の保存する仕組み
- 各関数(e.g., $f$ )における伝搬してきた損失値の出力値に対する微分 (e.g., $\frac{\partial L}{\partial f}$) から入力値に対する微分 (e.g., $\frac{\partial L}{\partial f}\frac{\partial f}{\partial g}$) をもらって受け渡す仕組み．

以上から昨日chainerの例と共に出した，Function の forward 関数の正体は入力から出力を計算し，backward 関数は二番目の出力の微分から入力の微分を返す関数でした．

** 変数 Variable の仕組み

上記の二箇所は ~Variable(T, size_t dim, alias Storage)~ の中に実装することになりますが，履歴の有向グラフの型が問題になります．Variableは次元 ~dim~ などを様々な型変数に持つために，

#+begin_src d
struct Variable(T, size_t dim, alias Storage, Args...) {
  Function func; // 合成元の関数
  Tuple!(Args) args; // 合成元の関数の入力
  RefCounted!(Storage!T) data, grad;
}
#+end_src

として，書くと動的にグラフを作る再帰NNなどの例を考えると，2回再帰したあとのVariableと，3回再帰した後のVariableで型が変わるわけです．TheanoのようにScanなどの特殊な型を作れば解決できますが，さすがに使い勝手が悪いので，うまく型消去した型 ~struct UntypedVariable~ を作ります．

#+begin_src d
struct UntypedVariable {
    import std.variant : Variant;
    size_t dim;
    size_t[] shape;
    ptrdiff_t[] strides;
    bool isHost;
    TypeInfo elem;
    Variant data, grad; // 型消去した HostStorage!T または DeviceStorage!T
}
#+end_src


- この日の最終 commit (構想だけに終わって実装できてないところも多い) https://github.com/ShigekiKarita/grain/tree/8825341f9a1986d1916d6433ec4dd26562f2d977

* BackPropの実装とテスト (6日目, 5/12)

この日は風邪が治ってきたので，実際に微分可能な変数と関数を実装して動かした．
昨日の続きで，関数の型消去...ではなく，関数のbackward関数を型消去したdelegateと必要な引数を集めるBackProp構造体を作ります．

