notes/d-deep-learning.html

<div id="outline-container-org6a89c72" class="outline-3">
<h3 id="org6a89c72"><span class="section-number-3">4.2</span> BLASライブラリの導入</h3>
<div class="outline-text-3" id="text-4-2">
<p>
さすがに自前で行列演算までは実装したくないので，Mirの人が作ってくれたndslice用のBLASラッパー<a href="https://github.com/kaleidicassociates/lubeck">lubeck</a>と，以前に作った<a href="https://github.com/ShigekiKarita/d-nv/blob/7946c12c5657d0a9e73167792d1565f2f1474e86/source/dnv/cuda/cublas.d#L1">cuBLASラッパー</a>を使うことにしました．CPU用のBLASのバックエンドは<a href="https://shigekikarita.github.io/blog/2017/10/27/001.html">経験的に速いIntel MKL</a>を使います．
</p>

<ul class="org-ul">
<li>この日の最終 commit (とくに変更はない) <a href="https://github.com/ShigekiKarita/grain/tree/e58940b2b18b921e0cc22f86511e67e245e0b13b">https://github.com/ShigekiKarita/grain/tree/e58940b2b18b921e0cc22f86511e67e245e0b13b</a></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orge023f2f" class="outline-2">
<h2 id="orge023f2f"><span class="section-number-2">5</span> シンプルな自動微分メカニズムと型消去 (5日目, 5/11)</h2>
<div class="outline-text-2" id="text-5">
<p>
出張先の神奈川が京都と比べて寒すぎた．風邪を引いて一日中寝てたので，大まかな設計を考えて，3,4日目に考えたCUDA依存の条件コンパイルと自動微分関数(ReLU, MatMul)を実装した．
</p>
</div>

<div id="outline-container-org240d69b" class="outline-3">
<h3 id="org240d69b"><span class="section-number-3">5.1</span> 自動微分の仕組み</h3>
<div class="outline-text-3" id="text-5-1">
<p>
多層ニューラルネットワークの自動微分は，合成関数の導関数=<a href="https://ja.wikipedia.org/wiki/%E9%80%A3%E9%8E%96%E5%BE%8B">微分の連鎖律</a>によって成り立っている．
</p>

\begin{align}
y &= f(g(x)) \\
\frac{\partial f}{\partial x} &= \frac{\partial f}{\partial g}\frac{\partial g}{\partial x}
\end{align}

<p>
例えば一層目のニューラルネットワーク(=パラメータ行列によるアフィン変換とReLUなどの非線形変換の合成関数)を \(g\), 二層目を \(f\) と書くと，損失関数をLとすると入力 \(x\) に対する損失値は \(L(f(g(x)))\) として表されます．このような多層ニューラルネットに対して損失値を最小化するためには backprop と呼ばれる効率的なアルゴリズムがあります．
</p>

<ul class="org-ul">
<li>二層目を \(f(x) -= \frac{\partial L}{\partial f}\) となるように，さらに連鎖律でアフィン変換のパラメータ行列の勾配までもとめて更新する．</li>
<li>一層目を \(g(x) -= \frac{\partial L}{\partial f}\frac{\partial f}{\partial g}\) となるように更新する．ここで， \(\frac{\partial L}{\partial f}\) は二層で求めた値なので，そのまま効率よく使いまわせます．この手順を逆伝搬=backpropといいます．</li>
</ul>

<p>
backpropに必要な実装として，
</p>

<ul class="org-ul">
<li>\(L(f(g(x)))\) のように変数が L &lt;- f &lt;- g として作られてきた連鎖の履歴として有向グラフ(複数の変数から1つの変数が作られたりするのでリストではない)の保存する仕組み</li>
<li>各関数(e.g., \(f\) )における伝搬してきた損失値の出力値に対する微分 (e.g., \(\frac{\partial L}{\partial f}\)) から入力値に対する微分 (e.g., \(\frac{\partial L}{\partial f}\frac{\partial f}{\partial g}\)) をもらって受け渡す仕組み．</li>
</ul>

<p>
以上から昨日chainerの例と共に出した，Function の forward 関数の正体は入力から出力を計算し，backward 関数は二番目の出力の微分から入力の微分を返す関数でした．
</p>
</div>
</div>

<div id="outline-container-orge7280af" class="outline-3">
<h3 id="orge7280af"><span class="section-number-3">5.2</span> 変数 Variable の仕組み</h3>
<div class="outline-text-3" id="text-5-2">
<p>
上記の二箇所は <code>Variable(T, size_t dim, alias Storage)</code> の中に実装することになりますが，履歴の有向グラフの型が問題になります．Variableは次元 <code>dim</code> などを様々な型変数に持つために，
</p>

<div class="org-src-container">
<pre class="src src-d"><span style="color: #268bd2; font-weight: bold;">struct</span> <span style="color: #af005f; font-weight: bold;">Variable</span><span style="color: #268bd2;">(</span><span style="color: #af005f; font-weight: bold;">T</span>, <span style="color: #af005f; font-weight: bold;">size_t</span> <span style="color: #af5fd7;">dim</span>, <span style="color: #268bd2; font-weight: bold;">alias</span> <span style="color: #af005f; font-weight: bold;">Storage</span>, <span style="color: #af005f; font-weight: bold;">Args</span>...<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">{</span>
  <span style="color: #af005f; font-weight: bold;">Function</span> <span style="color: #af5fd7;">func</span>; <span style="color: #008787; background-color: #ffffff;">// </span><span style="color: #008787; background-color: #ffffff;">&#21512;&#25104;&#20803;&#12398;&#38306;&#25968;</span>
  Tuple<span style="color: #8700af;">!</span><span style="color: #8700af;">(</span><span style="color: #af005f; font-weight: bold;">Args</span><span style="color: #8700af;">)</span> args; <span style="color: #008787; background-color: #ffffff;">// </span><span style="color: #008787; background-color: #ffffff;">&#21512;&#25104;&#20803;&#12398;&#38306;&#25968;&#12398;&#20837;&#21147;</span>
  RefCounted<span style="color: #8700af;">!</span><span style="color: #8700af;">(</span>Storage<span style="color: #8700af;">!</span>T<span style="color: #8700af;">)</span> data, grad;
<span style="color: #268bd2;">}</span>
</pre>
</div>

<p>
として，書くと動的にグラフを作る再帰NNなどの例を考えると，2回再帰したあとのVariableと，3回再帰した後のVariableで型が変わるわけです．TheanoのようにScanなどの特殊な型を作れば解決できますが，さすがに使い勝手が悪いので，うまく型消去した型 <code>struct UntypedVariable</code> を作ります．
</p>

<div class="org-src-container">
<pre class="src src-d"><span style="color: #268bd2; font-weight: bold;">struct</span> <span style="color: #af005f; font-weight: bold;">UntypedVariable</span> <span style="color: #268bd2;">{</span>
    <span style="color: #268bd2; font-weight: bold;">import</span> std.<span style="color: #af005f; font-weight: bold;">variant</span> : Variant;
    <span style="color: #af005f; font-weight: bold;">size_t</span> <span style="color: #af5fd7;">dim</span>;
    <span style="color: #af005f; font-weight: bold;">size_t</span><span style="color: #8700af;">[]</span> <span style="color: #af5fd7;">shape</span>;
    <span style="color: #af005f; font-weight: bold;">ptrdiff_t</span><span style="color: #8700af;">[]</span> <span style="color: #af5fd7;">strides</span>;
    <span style="color: #af005f; font-weight: bold;">bool</span> <span style="color: #af5fd7;">isHost</span>;
    <span style="color: #af005f; font-weight: bold;">TypeInfo</span> <span style="color: #af5fd7;">elem</span>;
    <span style="color: #af005f; font-weight: bold;">Variant</span> <span style="color: #af5fd7;">data</span>, <span style="color: #af5fd7;">grad</span>; <span style="color: #008787; background-color: #ffffff;">// </span><span style="color: #008787; background-color: #ffffff;">&#22411;&#28040;&#21435;&#12375;&#12383; HostStorage!T &#12414;&#12383;&#12399; DeviceStorage!T</span>
<span style="color: #268bd2;">}</span>
</pre>
</div>


<ul class="org-ul">
<li>この日の最終 commit (構想だけに終わって実装できてないところも多い) <a href="https://github.com/ShigekiKarita/grain/tree/8825341f9a1986d1916d6433ec4dd26562f2d977">https://github.com/ShigekiKarita/grain/tree/8825341f9a1986d1916d6433ec4dd26562f2d977</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org8ce5c2c" class="outline-2">
<h2 id="org8ce5c2c"><span class="section-number-2">6</span> BackPropの実装とテスト (6日目, 5/12)</h2>
<div class="outline-text-2" id="text-6">
<p>
この日は風邪が治ってきたので，実際に微分可能な変数と関数を実装して動かした．
昨日の続きで，関数の型消去&#x2026;ではなく，関数のbackward関数を型消去したdelegateと必要な引数を集めるBackProp構造体を作ります．
</p>
</div>
