notes/d-deep-learning.org
** BackProp の実装

先日のFunctionを継承したReLUの実装には問題がありました． ~class~ を使っているので， ~Function~ が持つGPU配列が結局GCの管理下におかれてしまっています．ただ最初の実装として，完璧である必要はないのでとりあえずテストできる動くものを作った訳です．C++のように効率の追求もできるけど，簡単にプロトタイピングもできるのがD言語のいいところですね．

解決策としては，冒頭に述べたような関数オブジェクトの backward 関数に出力の微分値リスト(~UntypedVariable[]~)を適用して，入力の微分値リスト(~UntypedVariable[]~)を返すdelegateのような ~BackProp~ オブジェクトを参照カウンタで管理すれば良いわけです．以上をまとめるとこんな感じの相互再帰みたいにかけます．

#+begin_src d
struct UntypedVariable {
  ...
  RefCounted!BackProp bprop;
  // 出力された変数のtuple中の位置
  size_t outPosition = 0;

  // loss のような backprop の起点は gradOutput が null
  void backward(UntypedVariable* gradOutput=null) {
    if (bprop.refCountedStore.isInitialized) {
      bprop.backward(outPosition, gradOutput);
    }
  }
}

struct BackProp {
  // 合成元の逆伝搬関数 (ReLUのbackwardに
  UntypedVariable[] delegate(UntypedVariable[]) proc;
  // 出力値の微分 (forward時に出力tupleの要素数で初期化される)
  UntypedVariable[] gradOutputs;
  // 合成元の関数の入力 (初期化はされない)
  UntypedVariable[] inputs;
  // 受け取った gradOutputs の数
  size_t nGrad = 0;

  void backward(size_t pos, UntypedVariable* grad) {
    if (grad is null) {
      enforce(gradOutputs.empty, "this variable is not loss");
    } else {
      ++nGrad;
      gradOutputs[pos] = grad;
    }
    // 出力値の全ての微分が集まった
    if (grad is null || nGrad + 1 == gradOutputs.length) {
      auto gradInputs = proc(gradOutputs);
      foreach (i; 0..inputs.length) {
        inputs[i].backward(gradInputs[i]);
      }
    }
  }
}
#+end_src

イメージとしては BackPropの起点の ~Variable!(...) loss~ (損失値) から, ~gradOutput = [1]~ として逆伝搬できます．


* 手書き文字認識MNISTの実行 (7日目, 5/13)

ここまでできたらあとはSoftMaxCrossEntropy関数などを実装して[[https://twitter.com/fchollet/status/807198327288791040][Deep LearningのUnit Testといわれる手書き文字認識MNIST]]を動かします．

注：後日6/8に動くようになったようです． 1週間くらいでモチベーションが消えてきて，実際は1ヶ月かかってしまった．笑

https://github.com/ShigekiKarita/grain/blob/5c5d6226e153ebcb6debd1d923783a2b7de53eaa/example/mnist.d

* TODO 残った課題

- カーネル引数の静的型チェック
- GC配列をMirのstdcSliceへの置き換え
- 遅延評価による静的グラフの最適化
- UntypedVariableからVariableへの動的型チェック (後日やりました)
- cuDNNとCNNのサポート (後日やりました)
