notes/d-deep-learning.html

<div id="outline-container-org7934370" class="outline-3">
<h3 id="org7934370"><span class="section-number-3">6.1</span> BackProp の実装</h3>
<div class="outline-text-3" id="text-6-1">
<p>
先日のFunctionを継承したReLUの実装には問題がありました． <code>class</code> を使っているので， <code>Function</code> が持つGPU配列が結局GCの管理下におかれてしまっています．ただ最初の実装として，完璧である必要はないのでとりあえずテストできる動くものを作った訳です．C++のように効率の追求もできるけど，簡単にプロトタイピングもできるのがD言語のいいところですね．
</p>

<p>
解決策としては，冒頭に述べたような関数オブジェクトの backward 関数に出力の微分値リスト(<code>UntypedVariable[]</code>)を適用して，入力の微分値リスト(<code>UntypedVariable[]</code>)を返すdelegateのような <code>BackProp</code> オブジェクトを参照カウンタで管理すれば良いわけです．以上をまとめるとこんな感じの相互再帰みたいにかけます．
</p>

<div class="org-src-container">
<pre class="src src-d"><span style="color: #268bd2; font-weight: bold;">struct</span> <span style="color: #af005f; font-weight: bold;">UntypedVariable</span> <span style="color: #268bd2;">{</span>
  ...
  RefCounted<span style="color: #8700af;">!</span>BackProp <span style="color: #af5fd7;">bprop</span>;
  <span style="color: #008787; background-color: #ffffff;">// </span><span style="color: #008787; background-color: #ffffff;">&#20986;&#21147;&#12373;&#12428;&#12383;&#22793;&#25968;&#12398;tuple&#20013;&#12398;&#20301;&#32622;</span>
  <span style="color: #af005f; font-weight: bold;">size_t</span> <span style="color: #af5fd7;">outPosition</span> = <span style="color: #8700af;">0</span>;

  <span style="color: #008787; background-color: #ffffff;">// </span><span style="color: #008787; background-color: #ffffff;">loss &#12398;&#12424;&#12358;&#12394; backprop &#12398;&#36215;&#28857;&#12399; gradOutput &#12364; null</span>
  <span style="color: #af005f; font-weight: bold;">void</span> <span style="color: #8700af; font-weight: bold;">backward</span><span style="color: #8700af;">(</span><span style="color: #af005f; font-weight: bold;">UntypedVariable</span>* <span style="color: #af5fd7;">gradOutput</span>=<span style="color: #8700af;">null</span><span style="color: #8700af;">)</span> <span style="color: #8700af;">{</span>
    <span style="color: #268bd2; font-weight: bold;">if</span> <span style="color: #2aa198;">(</span>bprop.refCountedStore.isInitialized<span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
      bprop.backward<span style="color: #5faf00;">(</span>outPosition, gradOutput<span style="color: #5faf00;">)</span>;
    <span style="color: #2aa198;">}</span>
  <span style="color: #8700af;">}</span>
<span style="color: #268bd2;">}</span>

<span style="color: #268bd2; font-weight: bold;">struct</span> <span style="color: #af005f; font-weight: bold;">BackProp</span> <span style="color: #268bd2;">{</span>
  <span style="color: #008787; background-color: #ffffff;">// </span><span style="color: #008787; background-color: #ffffff;">&#21512;&#25104;&#20803;&#12398;&#36870;&#20253;&#25644;&#38306;&#25968; (ReLU&#12398;backward&#12395;</span>
  <span style="color: #af005f; font-weight: bold;">UntypedVariable</span><span style="color: #8700af;">[]</span> <span style="color: #af005f; font-weight: bold;">delegate</span><span style="color: #8700af;">(</span><span style="color: #af005f; font-weight: bold;">UntypedVariable</span><span style="color: #2aa198;">[]</span><span style="color: #8700af;">)</span> proc;
  <span style="color: #008787; background-color: #ffffff;">// </span><span style="color: #008787; background-color: #ffffff;">&#20986;&#21147;&#20516;&#12398;&#24494;&#20998; (forward&#26178;&#12395;&#20986;&#21147;tuple&#12398;&#35201;&#32032;&#25968;&#12391;&#21021;&#26399;&#21270;&#12373;&#12428;&#12427;)</span>
  <span style="color: #af005f; font-weight: bold;">UntypedVariable</span><span style="color: #8700af;">[]</span> <span style="color: #af5fd7;">gradOutputs</span>;
  <span style="color: #008787; background-color: #ffffff;">// </span><span style="color: #008787; background-color: #ffffff;">&#21512;&#25104;&#20803;&#12398;&#38306;&#25968;&#12398;&#20837;&#21147; (&#21021;&#26399;&#21270;&#12399;&#12373;&#12428;&#12394;&#12356;)</span>
  <span style="color: #af005f; font-weight: bold;">UntypedVariable</span><span style="color: #8700af;">[]</span> <span style="color: #af5fd7;">inputs</span>;
  <span style="color: #008787; background-color: #ffffff;">// </span><span style="color: #008787; background-color: #ffffff;">&#21463;&#12369;&#21462;&#12387;&#12383; gradOutputs &#12398;&#25968;</span>
  <span style="color: #af005f; font-weight: bold;">size_t</span> <span style="color: #af5fd7;">nGrad</span> = <span style="color: #8700af;">0</span>;

  <span style="color: #af005f; font-weight: bold;">void</span> <span style="color: #8700af; font-weight: bold;">backward</span><span style="color: #8700af;">(</span><span style="color: #af005f; font-weight: bold;">size_t</span> <span style="color: #af5fd7;">pos</span>, <span style="color: #af005f; font-weight: bold;">UntypedVariable</span>* <span style="color: #af5fd7;">grad</span><span style="color: #8700af;">)</span> <span style="color: #8700af;">{</span>
    <span style="color: #268bd2; font-weight: bold;">if</span> <span style="color: #2aa198;">(</span>grad <span style="color: #268bd2; font-weight: bold;">is</span> <span style="color: #8700af;">null</span><span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
      enforce<span style="color: #5faf00;">(</span>gradOutputs.empty, <span style="color: #2aa198;">"this variable is not loss"</span><span style="color: #5faf00;">)</span>;
    <span style="color: #2aa198;">}</span> <span style="color: #268bd2; font-weight: bold;">else</span> <span style="color: #2aa198;">{</span>
      ++nGrad;
      gradOutputs<span style="color: #5faf00;">[</span>pos<span style="color: #5faf00;">]</span> = grad;
    <span style="color: #2aa198;">}</span>
    <span style="color: #008787; background-color: #ffffff;">// </span><span style="color: #008787; background-color: #ffffff;">&#20986;&#21147;&#20516;&#12398;&#20840;&#12390;&#12398;&#24494;&#20998;&#12364;&#38598;&#12414;&#12387;&#12383;</span>
    <span style="color: #268bd2; font-weight: bold;">if</span> <span style="color: #2aa198;">(</span>grad <span style="color: #268bd2; font-weight: bold;">is</span> <span style="color: #8700af;">null</span> || nGrad + <span style="color: #8700af;">1</span> == gradOutputs.length<span style="color: #2aa198;">)</span> <span style="color: #2aa198;">{</span>
      <span style="color: #268bd2; font-weight: bold;">auto</span> <span style="color: #af5fd7;">gradInputs</span> = proc<span style="color: #5faf00;">(</span>gradOutputs<span style="color: #5faf00;">)</span>;
      <span style="color: #268bd2; font-weight: bold;">foreach</span> <span style="color: #5faf00;">(</span>i; <span style="color: #8700af;">0</span>..inputs.length<span style="color: #5faf00;">)</span> <span style="color: #5faf00;">{</span>
        <span style="color: #af005f; font-weight: bold;">inputs</span><span style="color: #875f00;">[</span>i<span style="color: #875f00;">]</span>.<span style="color: #8700af; font-weight: bold;">backward</span><span style="color: #875f00;">(</span><span style="color: #af005f; font-weight: bold;">gradInputs</span><span style="color: #268bd2;">[</span>i<span style="color: #268bd2;">]</span><span style="color: #875f00;">)</span>;
      <span style="color: #5faf00;">}</span>
    <span style="color: #2aa198;">}</span>
  <span style="color: #8700af;">}</span>
<span style="color: #268bd2;">}</span>
</pre>
</div>

<p>
イメージとしては BackPropの起点の <code>Variable!(...) loss</code> (損失値) から, <code>gradOutput = [1]</code> として逆伝搬できます．
</p>
</div>
</div>
</div>


<div id="outline-container-org2c962e2" class="outline-2">
<h2 id="org2c962e2"><span class="section-number-2">7</span> 手書き文字認識MNISTの実行 (7日目, 5/13)</h2>
<div class="outline-text-2" id="text-7">
<p>
ここまでできたらあとはSoftMaxCrossEntropy関数などを実装して<a href="https://twitter.com/fchollet/status/807198327288791040">Deep LearningのUnit Testといわれる手書き文字認識MNIST</a>を動かします．
</p>

<p>
注：後日6/8に動くようになったようです． 1週間くらいでモチベーションが消えてきて，実際は1ヶ月かかってしまった．笑
</p>

<p>
<a href="https://github.com/ShigekiKarita/grain/blob/5c5d6226e153ebcb6debd1d923783a2b7de53eaa/example/mnist.d">https://github.com/ShigekiKarita/grain/blob/5c5d6226e153ebcb6debd1d923783a2b7de53eaa/example/mnist.d</a>
</p>
</div>
</div>

<div id="outline-container-orgbafb3f3" class="outline-2">
<h2 id="orgbafb3f3"><span class="section-number-2">8</span> <span class="todo TODO">TODO</span> 残った課題</h2>
<div class="outline-text-2" id="text-8">
<ul class="org-ul">
<li>カーネル引数の静的型チェック</li>
<li>GC配列をMirのstdcSliceへの置き換え</li>
<li>遅延評価による静的グラフの最適化</li>
<li>UntypedVariableからVariableへの動的型チェック (後日やりました)</li>
<li>cuDNNとCNNのサポート (後日やりました)</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: Shigeki Karita</p>
<p class="date">Created: 2018-10-25 木 00:36</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="https://orgmode.org">Org</a> mode 9.1.8)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
